export class Chair {
  public shortName: string;
  public name: string;
}

export const CHAIR_LIST: Chair[] = [
  {
    shortName: 'ААЕ',
    name: 'Кафедра акустики та акустоелектроніки'
  },
  {
    shortName: 'АЕ',
    name: 'Кафедра автоматизації енергосистем'
  },
  {
    shortName: 'АЕД',
    name: 'Кафедра автоматизації експериментальних досліджень'
  },
  {
    shortName: 'АЕМСЕП',
    name: 'Кафедра автоматизації електромеханічних систем та електроприводу'
  },
  {
    shortName: 'АЕС та ІТФ',
    name: 'Кафедра атомних електростанцій та інженерної теплофізики'
  },
  {
    shortName: 'АПЕПС',
    name: 'Кафедра автоматизації проектування енергетичних процесів та систем'
  },
  {
    shortName: 'АРБ',
    name: 'Кафедра авіа- та ракетобудування'
  },
  {
    shortName: 'АСОІУ',
    name: 'Кафедра автоматизованих систем обробки інформації та управління'
  },
  {
    shortName: 'АТЕП',
    name: 'Кафедра автоматизації теплоенергетичних процесів'
  },
  {
    shortName: 'АУЕК',
    name: 'Кафедра автоматизації управління електротехнічними комплексами'
  },
  {
    shortName: 'АУТС',
    name: 'Кафедра автоматики та управління в технічних системах'
  },
  {
    shortName: 'АХВ',
    name: 'Кафедра автоматизації хімічних виробництв'
  },
  {
    shortName: 'ББЗЛ',
    name: 'Кафедра біобезпеки і здоров\'я людини'
  },
  {
    shortName: 'БМІ',
    name: 'Кафедра біомедичної інженерії'
  },
  {
    shortName: 'БМК',
    name: 'Кафедра біомедичної кібернетики'
  },
  {
    shortName: 'БТІ',
    name: 'Кафедра біотехніки та інженерії'
  },
  {
    shortName: 'ВДЕ',
    name: 'Кафедра відновлюваних джерел енергії'
  },
  {
    shortName: 'ВМПМ',
    name: 'Кафедра високотемпературих матеріалів та порошкової металургії'
  },
  {
    shortName: 'ВП',
    name: 'Кафедра виробництва приладів'
  },
  {
    shortName: 'ВСР',
    name: 'Кафедра видавничої справи та редагування'
  },
  {
    shortName: 'ГІ',
    name: 'Кафедра геоінженерії'
  },
  {
    shortName: 'ДММОМ',
    name: 'Кафедра динаміки, міцності машин та опору матеріалів'
  },
  {
    shortName: 'ДР',
    name: 'Кафедра диференціальних рівнянь'
  },
  {
    shortName: 'ЕЗУ',
    name: 'Кафедра електрозварювальних установок'
  },
  {
    shortName: 'ЕМ',
    name: 'Кафедра електромеханіки'
  },
  {
    shortName: 'ЕМОЕВ',
    name: 'Кафедра електромеханічного обладнання енергоємних виробництв'
  },
  {
    shortName: 'ЕМС',
    name: 'Кафедра електричних мереж і систем'
  },
  {
    shortName: 'ЕП',
    name: 'Кафедра електропостачання'
  },
  {
    shortName: 'ЕПП',
    name: 'Кафедра електронних приладів та пристроїв'
  },
  {
    shortName: 'ЕТРП',
    name: 'Кафедра екології та технології рослинних полімерів'
  },
  {
    shortName: 'ЗВ',
    name: 'Кафедра зварювального виробництва'
  },
  {
    shortName: 'ЗНХ',
    name: 'Кафедра загальної та неорганічної хімії'
  },
  {
    shortName: 'ЗТРІ',
    name: 'Кафедра звукотехніки та реєстрації інформації'
  },
  {
    shortName: 'ЗФФТТ',
    name: 'Кафедра загальної фiзики та фiзики твердого тiла'
  },
  {
    shortName: 'ІБ',
    name: 'Кафедра інформаційної безпеки'
  },
  {
    shortName: 'ІВТ',
    name: 'Кафедра інформаційно-вимірювальної техніки'
  },
  {
    shortName: 'ІЕ',
    name: 'Кафедра інженерної екології'
  },
  {
    shortName: 'ІТМ',
    name: 'Кафедра інтегрованих технологій машинобудування'
  },
  {
    shortName: 'КАМГС3',
    name: 'Кафедра англійської мови гуманітарного спрямування № 3'
  },
  {
    shortName: 'КАМТС1',
    name: 'Кафедра англійської мови технічного спрямування № 1'
  },
  {
    shortName: 'КАМТС2',
    name: 'Кафедра англійської мови технічного спрямування № 2'
  },
  {
    shortName: 'КБ',
    name: 'Кафедра біоінформатики'
  },
  {
    shortName: 'КВМ',
    name: 'Кафедра конструювання верстатів та машин'
  },
  {
    shortName: 'КВП',
    name: 'Кафедра військової підготовки'
  },
  {
    shortName: 'КГ',
    name: 'Кафедра графіки'
  },
  {
    shortName: 'КГАП',
    name: 'Кафедра господарського та адміністративного права'
  },
  {
    shortName: 'КЕБ',
    name: 'Кафедра екобіотехнології та біоенергетики'
  },
  {
    shortName: 'КЕОА',
    name: 'Кафедра конструювання електронно-обчислювальної апаратури'
  },
  {
    shortName: 'КЕП',
    name: 'Кафедра економіки та підприємництва'
  },
  {
    shortName: 'КЗЕФ',
    name: 'Кафедра загальної та експериментальної фiзики'
  },
  {
    shortName: 'КЗТФ',
    name: 'Кафедра загальної та теоретичної фiзики'
  },
  {
    shortName: 'КІ',
    name: 'Кафедра історії'
  },
  {
    shortName: 'КІВРА',
    name: 'Кафедра радіоконструювання та виробництва радіоапаратури'
  },
  {
    shortName: 'КІП',
    name: 'Кафедра інженерії поверхні'
  },
  {
    shortName: 'КІППІВ',
    name: 'Кафедра інформаційного права та права інтелектуальної власності'
  },
  {
    shortName: 'КІТМ',
    name: 'Кафедра інформаційно-телекомунікаційних мереж'
  },
  {
    shortName: 'КМ',
    name: 'Кафедра менеджменту'
  },
  {
    shortName: 'КМЕ',
    name: 'Кафедра міжнародної економіки'
  },
  {
    shortName: 'КМП',
    name: 'Кафедра мовної підготовки іноземців'
  },
  {
    shortName: 'КМФ',
    name: 'Кафедра математичної фізики'
  },
  {
    shortName: 'КПП',
    name: 'Кафедра публічного права'
  },
  {
    shortName: 'КР',
    name: 'Кафедра репрографії'
  },
  {
    shortName: 'КС',
    name: 'Кафедра соціології'
  },
  {
    shortName: 'КТК',
    name: 'Кафедра технічної кібернетики'
  },
  {
    shortName: 'КТППАМ',
    name: 'Кафедра теорії, практики та перекладу англійської мови'
  },
  {
    shortName: 'КТППНМ',
    name: 'Кафедра теорії, практики та перекладу німецької мови'
  },
  {
    shortName: 'КТППФМ',
    name: 'Кафедра теорії, практики та перекладу французької мови'
  },
  {
    shortName: 'КТПУ',
    name: 'Кафедра теорії та практики управління'
  },
  {
    shortName: 'КУМЛК',
    name: 'Кафедра української мови, літератури та культури'
  },
  {
    shortName: 'КФ',
    name: 'Кафедра фiлософiї'
  },
  {
    shortName: 'КХТП',
    name: 'Кафедра кібернетики хіміко-технологічних процесів'
  },
  {
    shortName: 'ЛВЧКМ',
    name: 'Кафедра ливарного виробництва чорних і кольорових металів'
  },
  {
    shortName: 'ЛТФТТ',
    name: 'Кафедра лазерної техніки та фізико-технічних технологій'
  },
  {
    shortName: 'МАПВ',
    name: 'Кафедра машин та агрегатів поліграфічного виробництва'
  },
  {
    shortName: 'МА та ТЙ',
    name: 'Кафедра математичного аналізу та теорії ймовірностей'
  },
  {
    shortName: 'МАХНВ',
    name: 'Кафедра машин та апаратів хімічних і нафтопереробних виробництв'
  },
  {
    shortName: 'МВПГ',
    name: 'Кафедра менеджменту видавничо-поліграфічної галузі'
  },
  {
    shortName: 'МЕ',
    name: 'Кафедра мікроелектроніки'
  },
  {
    shortName: 'ММЕС',
    name: 'Кафедра математичного моделювання економічних систем'
  },
  {
    shortName: 'ММЗІ',
    name: 'Кафедра математичних методiв захисту iнформацiї'
  },
  {
    shortName: 'ММСА',
    name: 'Кафедра математичних методів системного аналізу'
  },
  {
    shortName: 'МТО',
    name: 'Кафедра металознавства та термічної обробки'
  },
  {
    shortName: 'НАЕПС',
    name: 'Кафедра наукових, аналітичних та екологічних приладів і систем'
  },
  {
    shortName: 'НГІ та КГ',
    name: 'Кафедра нарисної геометрії, інженерної та комп\'ютерної графіки'
  },
  {
    shortName: 'ООЕП',
    name: 'Кафедра оптичних та оптико-електронних приладів'
  },
  {
    shortName: 'ОППЦБ',
    name: 'Кафедра охорони працi, промислової та цивільної безпеки'
  },
  {
    shortName: 'ОТ',
    name: 'Кафедра обчислювальної техніки'
  },
  {
    shortName: 'ОХТОР',
    name: 'Кафедра органічної хімії та технології органічних речовин'
  },
  {
    shortName: 'ПБ',
    name: 'Кафедра приладобудування'
  },
  {
    shortName: 'ПБТ',
    name: 'Кафедра промислової біотехнології'
  },
  {
    shortName: 'ПГМ',
    name: 'Кафедра прикладної гідроаеромеханіки і механотроніки'
  },
  {
    shortName: 'ПЕ',
    name: 'Кафедра промислової електроніки'
  },
  {
    shortName: 'ПЗКС',
    name: 'Кафедра програмного забезпечення комп\'ютерних систем'
  },
  {
    shortName: 'ПМА',
    name: 'Кафедра прикладної математики'
  },
  {
    shortName: 'ПМФММ',
    name: 'Кафедра промислового маркетингу'
  },
  {
    shortName: 'ПП',
    name: 'Кафедра психології і педагогіки'
  },
  {
    shortName: 'ПСНК',
    name: 'Кафедра приладів і систем неруйнівного контролю'
  },
  {
    shortName: 'ПСОН',
    name: 'Кафедра приладів та сиcтем орієнтації та навігації'
  },
  {
    shortName: 'ПФ',
    name: 'Кафедра прикладної фізики'
  },
  {
    shortName: 'РОС',
    name: 'Кафедра радіоприймання та оброблення сигналів'
  },
  {
    shortName: 'РТПС',
    name: 'Кафедра радіотехнічних пристроїв і систем'
  },
  {
    shortName: 'СВ',
    name: 'Кафедра спортивного вдосконалення'
  },
  {
    shortName: 'СКЛА',
    name: 'Кафедра систем керування літальними апаратами'
  },
  {
    shortName: 'СП',
    name: 'Кафедра системного проектування'
  },
  {
    shortName: 'СПСКС',
    name: 'Кафедра системного програмування і спеціалізованих комп’ютерних систем'
  },
  {
    shortName: 'ТВЛА',
    name: 'Кафедра технології виробництва літальних апаратів'
  },
  {
    shortName: 'ТЕ',
    name: 'Кафедра теплотехніки та енергозбереження'
  },
  {
    shortName: 'ТЕУТ та АЕС',
    name: 'Кафедра теплоенергетичних установок теплових та атомних електростанцій'
  },
  {
    shortName: 'ТЕХВ',
    name: 'Кафедра технології електрохімічних виробництв'
  },
  {
    shortName: 'ТК',
    name: 'Кафедра телекомунікацій'
  },
  {
    shortName: 'ТМ ММІ',
    name: 'Кафедра технології машинобудування'
  },
  {
    shortName: 'ТМБ',
    name: 'Кафедра трансляційної медичної біоінженерії'
  },
  {
    shortName: 'МЕ',
    name: 'Кафедра технології неорганічних речовин, водоочищення та загальної хімічної технології'
  },
  {
    shortName: 'ТНР,ВтаЗХТ',
    name: 'Кафедра'
  },
  {
    shortName: 'ТОЕ',
    name: 'Кафедра теоретичної електротехніки'
  },
  {
    shortName: 'ТОР',
    name: 'Кафедра теоретичних основ радіотехніки'
  },
  {
    shortName: 'ТПВ',
    name: 'Кафедра технології поліграфічного виробництва'
  },
  {
    shortName: 'ТПЕ',
    name: 'Кафедра теоретичної та прикладної економіки'
  },
  {
    shortName: 'ТПТ',
    name: 'Кафедра теоретичної та промислової теплотехніки'
  },
  {
    shortName: 'ТС',
    name: 'Кафедра телекомунікаційних систем'
  },
  {
    shortName: 'ФБМЕ',
    name: 'Кафедра електронної інженерії'
  },
  {
    shortName: 'ФВ',
    name: 'Кафедра фізичного виховання'
  },
  {
    shortName: 'ФЕС',
    name: 'Кафедра фізики енергетичних систем'
  },
  {
    shortName: 'ФМ',
    name: 'Кафедра фiзики металiв'
  },
  {
    shortName: 'ФТЗЗІ',
    name: 'Кафедра фiзико-технiчних засобiв захисту iнформацiї'
  },
  {
    shortName: 'ФХ',
    name: 'Кафедра фізичної хімії'
  },
  {
    shortName: 'ФХОТМ',
    name: 'Кафедра фізико-хімічних основ технології металів'
  },
  {
    shortName: 'ХПСМ',
    name: 'Кафедра хімічного, полiмерного і силікатного машинобудування'
  },
  {
    shortName: 'ХТКМ',
    name: 'Кафедра хімічної технології композиційних матеріалів'
  },
  {
    shortName: 'ХТКС',
    name: 'Кафедра хімічної технології кераміки та скла'
  },
];

export const CHAIR_MAP: Map<string, Chair[]> = new Map([
  ['ВПІ', [
    {
      shortName: 'ВСР',
      name: 'ВСР; Кафедра видавничої справи та редагування',
    },
    {
      shortName: 'КГ',
      name: 'КГ; Кафедра графіки',
    },
    {
      shortName: 'КР',
      name: 'КР; Кафедра репрографії',
    },
    {
      shortName: 'МАПВ',
      name: 'МАПВ; Кафедра машин та агрегатів поліграфічного виробництва',
    },
    {
      shortName: 'МВПГ',
      name: 'МВПГ; Кафедра менеджменту видавничо-поліграфічної галузі',
    },
    {
      shortName: 'ТПВ',
      name: 'ТПВ; Кафедра технології поліграфічного виробництва',
    }
  ]],
  ['ЗФ', [
    {
      shortName: 'ЕЗУ',
      name: 'ЕЗУ; Кафедра електрозварювальних установок',
    },
    {
      shortName: 'ЗВ',
      name: 'ЗВ; Кафедра зварювального виробництва',
    },
    {
      shortName: 'КІП',
      name: 'КІП; Кафедра інженерії поверхні',
    }
  ]],
  ['ІАТ', [
    {
      shortName: 'АРБ',
      name: 'АРБ; Кафедра авіа- та ракетобудування',
    },
    {
      shortName: 'СКЛА',
      name: 'СКЛА; Кафедра систем керування літальними апаратами',
    },
  ]],
  ['ІЕЕ', [
    {
      shortName: 'АУЕК',
      name: 'АУЕК; Кафедра автоматизації управління електротехнічними комплексами',
    },
    {
      shortName: 'ГІ',
      name: 'ГІ; Кафедра геоінженерії',
    },
    {
      shortName: 'ЕМОЕВ',
      name: 'ЕМОЕВ; Кафедра електромеханічного обладнання енергоємних виробництв',
    },
    {
      shortName: 'ЕП',
      name: 'ЕП; Кафедра електропостачання',
    },
    {
      shortName: 'ІЕ',
      name: 'ІЕ; Кафедра інженерної екології',
    },
    {
      shortName: 'ОППЦБ',
      name: 'ОППЦБ; Кафедра охорони працi, промислової та цивільної безпеки',
    },
    {
      shortName: 'ТЕ',
      name: 'ТЕ; Кафедра теплотехніки та енергозбереження',
    },
  ]],
  ['ІПСА', [
    {
      shortName: 'ММСА',
      name: 'ММСА; Кафедра математичних методів системного аналізу',
    },
    {
      shortName: 'СП',
      name: 'СП; Кафедра системного проектування',
    },
  ]],
  ['ІТС', [
    {
      shortName: 'КІТМ',
      name: 'КІТМ; Кафедра інформаційно-телекомунікаційних мереж',
    },
    {
      shortName: 'ТК',
      name: 'ТК; Кафедра телекомунікацій',
    },
    {
      shortName: 'ТС',
      name: 'ТС; Кафедра телекомунікаційних систем',
    },
  ]],
  ['ІФФ', [
    {
      shortName: 'ВМПМ',
      name: 'ВМПМ; Кафедра високотемпературих матеріалів та порошкової металургії',
    },
    {
      shortName: 'ЛВЧКМ',
      name: 'ЛВЧКМ; Кафедра ливарного виробництва чорних і кольорових металів',
    },
    {
      shortName: 'МТО',
      name: 'МТО; Кафедра металознавства та термічної обробки',
    },
    {
      shortName: 'ФМ',
      name: 'ФМ; Кафедра фiзики металiв',
    },
    {
      shortName: 'ФХОТМ',
      name: 'ФХОТМ; Кафедра фізико-хімічних основ технології металів',
    },
  ]],
  ['ІХФ', [
    {
      shortName: 'АХВ',
      name: 'АХВ; Кафедра автоматизації хімічних виробництв',
    },
    {
      shortName: 'ЕТРП',
      name: 'ЕТРП; Кафедра екології та технології рослинних полімерів',
    },
    {
      shortName: 'МАХНВ',
      name: 'МАХНВ; Кафедра машин та апаратів хімічних і нафтопереробних виробництв',
    },
    {
      shortName: 'ХПСМ',
      name: 'ХПСМ; Кафедра хімічного, полiмерного і силікатного машинобудування',
    },
  ]],
  ['ММІ', [
    {
      shortName: 'ДММОМ',
      name: 'ДММОМ; Кафедра динаміки, міцності машин та опору матеріалів',
    },
    {
      shortName: 'ІТМ',
      name: 'ІТМ; Кафедра інтегрованих технологій машинобудування',
    },
    {
      shortName: 'КВМ',
      name: 'КВМ; Кафедра конструювання верстатів та машин',
    },
    {
      shortName: 'ЛТФТТ',
      name: 'ЛТФТТ; Кафедра лазерної техніки та фізико-технічних технологій',
    },
    {
      shortName: 'ПГМ',
      name: 'ПГМ; Кафедра прикладної гідроаеромеханіки і механотроніки',
    },
    {
      shortName: 'ТВЛА',
      name: 'ТВЛА; Кафедра технології виробництва літальних апаратів',
    },
    {
      shortName: 'ТМ ММІ',
      name: 'ТМ ММІ; Кафедра технології машинобудування',
    },
  ]],
  ['ПБФ', [
    {
      shortName: 'АЕД',
      name: 'АЕД; Кафедра автоматизації експериментальних досліджень',
    },
    {
      shortName: 'ВП',
      name: 'ВП; Кафедра виробництва приладів',
    },
    {
      shortName: 'ІВТ',
      name: 'ІВТ; Кафедра інформаційно-вимірювальної техніки',
    },
    {
      shortName: 'НАЕПС',
      name: 'НАЕПС; Кафедра наукових, аналітичних та екологічних приладів і систем',
    },
    {
      shortName: 'ООЕП',
      name: 'ООЕП; Кафедра оптичних та оптико-електронних приладів',
    },
    {
      shortName: 'ПБ',
      name: 'ПБ; Кафедра приладобудування',
    },
    {
      shortName: 'ПСНК',
      name: 'ПСНК; Кафедра приладів і систем неруйнівного контролю',
    },
    {
      shortName: 'ПСОН',
      name: 'ПСОН; Кафедра приладів та сиcтем орієнтації та навігації',
    },
  ]],
  ['РТФ', [
    {
      shortName: 'КІВРА',
      name: 'КІВРА; Кафедра радіоконструювання та виробництва радіоапаратури',
    },
    {
      shortName: 'РОС',
      name: 'РОС; Кафедра радіоприймання та оброблення сигналів',
    },
    {
      shortName: 'РТПС',
      name: 'РТПС; Кафедра радіотехнічних пристроїв і систем',
    },
    {
      shortName: 'ТОР',
      name: 'ТОР; Кафедра теоретичних основ радіотехніки',
    },
  ]],
  ['ТЕФ', [
    {
      shortName: 'АЕСтаІТФ',
      name: 'АЕСтаІТФ; Кафедра атомних електростанцій та інженерної теплофізики',
    },
    {
      shortName: 'АПЕПС',
      name: 'АПЕПС; Кафедра автоматизації проектування енергетичних процесів та систем',
    },
    {
      shortName: 'АТЕП',
      name: 'АТЕП; Кафедра автоматизації теплоенергетичних процесів',
    },
    {
      shortName: 'ТЕУТтаАЕС',
      name: 'ТЕУТтаАЕС; Кафедра теплоенергетичних установок теплових та атомних електростанцій',
    },
    {
      shortName: 'ТПТ',
      name: 'ТПТ; Кафедра теоретичної та промислової теплотехніки',
    },
  ]],
  ['ФБМІ', [
    {
      shortName: 'ББЗЛ',
      name: 'ББЗЛ; Кафедра біобезпеки і здоров\'я людини',
    },
    {
      shortName: 'БМІ',
      name: 'БМІ; Кафедра біомедичної інженерії',
    },
    {
      shortName: 'БМК',
      name: 'БМК; Кафедра біомедичної кібернетики',
    },
    {
      shortName: 'СВ',
      name: 'СВ; Кафедра спортивного вдосконалення',
    },
    {
      shortName: 'ТМБ',
      name: 'ТМБ; Кафедра трансляційної медичної біоінженерії',
    },
    {
      shortName: 'ФВ',
      name: 'ФВ; Кафедра фізичного виховання',
    },
  ]],
  ['ФБТ', [
    {
      shortName: 'БТІ',
      name: 'БТІ; Кафедра біотехніки та інженерії',
    },
    {
      shortName: 'КБ',
      name: 'КБ; Кафедра біоінформатики',
    },
    {
      shortName: 'КЕБ',
      name: 'КЕБ; Кафедра екобіотехнології та біоенергетики',
    },
    {
      shortName: 'ПБТ',
      name: 'ПБТ; Кафедра промислової біотехнології',
    },
  ]],
  ['ФЕА', [
    {
      shortName: 'АЕ',
      name: 'АЕ; Кафедра автоматизації енергосистем',
    },
    {
      shortName: 'АЕМСЕП',
      name: 'АЕМСЕП; Кафедра автоматизації електромеханічних систем та електроприводу',
    },
    {
      shortName: 'ВДЕ',
      name: 'ВДЕ; Кафедра відновлюваних джерел енергії',
    },
    {
      shortName: 'ЕМ',
      name: 'ЕМ; Кафедра електромеханіки',
    },
    {
      shortName: 'ЕМС',
      name: 'ЕМС; Кафедра електричних мереж і систем',
    },
    {
      shortName: 'ТОЕ',
      name: 'ТОЕ; Кафедра теоретичної електротехніки',
    },
  ]],
  ['ФЕЛ', [
    {
      shortName: 'ААЕ',
      name: 'ААЕ; Кафедра акустики та акустоелектроніки',
    },
    {
      shortName: 'ЕПП',
      name: 'ЕПП; Кафедра електронних приладів та пристроїв',
    },
    {
      shortName: 'ЗТРІ',
      name: 'ЗТРІ; Кафедра звукотехніки та реєстрації інформації',
    },
    {
      shortName: 'КЕОА',
      name: 'КЕОА; Кафедра конструювання електронно-обчислювальної апаратури',
    },
    {
      shortName: 'МЕ',
      name: 'МЕ; Кафедра мікроелектроніки',
    },
    {
      shortName: 'ПЕ',
      name: 'ПЕ; Кафедра промислової електроніки',
    },
    {
      shortName: 'ФБМЕ',
      name: 'ФБМЕ; Кафедра електронної інженерії',
    },
  ]],
  ['ФІОТ', [
    {
      shortName: 'АСОІУ',
      name: 'АСОІУ; Кафедра автоматизованих систем обробки інформації та управління',
    },
    {
      shortName: 'АУТС',
      name: 'АУТС; Кафедра автоматики та управління в технічних системах',
    },
    {
      shortName: 'КТК',
      name: 'КТК; Кафедра технічної кібернетики',
    },
    {
      shortName: 'ОТ',
      name: 'ОТ; Кафедра обчислювальної техніки',
    },
  ]],
  ['ФЛ', [
    {
      shortName: 'КАМГС3',
      name: 'КАМГС3; Кафедра англійської мови гуманітарного спрямування № 3',
    },
    {
      shortName: 'КАМТС1',
      name: 'КАМТС1; Кафедра англійської мови технічного спрямування № 1',
    },
    {
      shortName: 'КАМТС2',
      name: 'КАМТС2; Кафедра англійської мови технічного спрямування № 2',
    },
    {
      shortName: 'КМП',
      name: 'КМП; Кафедра мовної підготовки іноземців',
    },
    {
      shortName: 'КТППАМ',
      name: 'КТППАМ; Кафедра теорії, практики та перекладу англійської мови',
    },
    {
      shortName: 'КТППНМ',
      name: 'КТППНМ; Кафедра теорії, практики та перекладу німецької мови',
    },
    {
      shortName: 'КТППФМ',
      name: 'КТППФМ; Кафедра теорії, практики та перекладу французької мови',
    },
    {
      shortName: 'КУМЛК',
      name: 'КУМЛК; Кафедра української мови, літератури та культури',
    },
  ]],
  ['ФММ', [
    {
      shortName: 'КЕП',
      name: 'КЕП; Кафедра економіки та підприємництва',
    },
    {
      shortName: 'КМ',
      name: 'КМ; Кафедра менеджменту',
    },
    {
      shortName: 'КМЕ',
      name: 'КМЕ; Кафедра міжнародної економіки',
    },
    {
      shortName: 'ММЕС',
      name: 'ММЕС; Кафедра математичного моделювання економічних систем',
    },
    {
      shortName: 'ПМФММ',
      name: 'ПМФММ; Кафедра промислового маркетингу',
    },
    {
      shortName: 'ТПЕ',
      name: 'ТПЕ; Кафедра теоретичної та прикладної економіки',
    },
  ]],
  ['ФМФ', [
    {
      shortName: 'ДР',
      name: 'ДР; Кафедра диференціальних рівнянь',
    },
    {
      shortName: 'ЗФФТТ',
      name: 'ЗФФТТ; Кафедра загальної фiзики та фiзики твердого тiла',
    },
    {
      shortName: 'КЗЕФ',
      name: 'КЗЕФ; Кафедра загальної та експериментальної фiзики',
    },
    {
      shortName: 'КЗТФ',
      name: 'КЗТФ; Кафедра загальної та теоретичної фiзики',
    },
    {
      shortName: 'КМФ',
      name: 'КМФ; Кафедра математичної фізики',
    },
    {
      shortName: 'МАтаТЙ',
      name: 'МАтаТЙ; Кафедра математичного аналізу та теорії ймовірностей',
    },
    {
      shortName: 'НГІтаКГ',
      name: 'НГІтаКГ; Кафедра нарисної геометрії, інженерної та комп\'ютерної графіки',
    },
  ]],
  ['ФПМ', [
    {
      shortName: 'ПЗКС',
      name: 'ПЗКС; Кафедра програмного забезпечення комп\'ютерних систем',
    },
    {
      shortName: 'ПМА',
      name: 'ПМА; Кафедра прикладної математики',
    },
    {
      shortName: 'СПСКС',
      name: 'СПСКС; Кафедра системного програмування і спеціалізованих комп’ютерних систем',
    },
  ]],
  ['ФСП', [
    {
      shortName: 'КГАП',
      name: 'КГАП; Кафедра господарського та адміністративного права',
    },
    {
      shortName: 'КІ',
      name: 'КІ; Кафедра історії',
    },
    {
      shortName: 'КІППІВ',
      name: 'КІППІВ; Кафедра інформаційного права та права інтелектуальної власності',
    },
    {
      shortName: 'КПП',
      name: 'КПП; Кафедра публічного права',
    },
    {
      shortName: 'КС',
      name: 'КС; Кафедра соціології',
    },
    {
      shortName: 'КТПУ',
      name: 'КТПУ; Кафедра теорії та практики управління',
    },
    {
      shortName: 'КФ',
      name: 'КФ; Кафедра фiлософiї',
    },
    {
      shortName: 'ПП',
      name: 'ПП; Кафедра психології і педагогіки',
    },
  ]],
  ['ФТІ', [
    {
      shortName: 'ІБ',
      name: 'ІБ; Кафедра інформаційної безпеки',
    },
    {
      shortName: 'ММЗІ',
      name: 'ММЗІ; Кафедра математичних методiв захисту iнформацiї',
    },
    {
      shortName: 'ПФ',
      name: 'ПФ; Кафедра прикладної фізики',
    },
    {
      shortName: 'ФЕС',
      name: 'ФЕС; Кафедра фізики енергетичних систем',
    },
    {
      shortName: 'ФТЗЗІ',
      name: 'ФТЗЗІ; Кафедра фiзико-технiчних засобiв захисту iнформацiї',
    },
  ]],
  ['ХТФ', [
    {
      shortName: 'ЗНХ',
      name: 'ЗНХ; Кафедра загальної та неорганічної хімії',
    },
    {
      shortName: 'КХТП',
      name: 'КХТП; Кафедра кібернетики хіміко-технологічних процесів',
    },
    {
      shortName: 'ОХТОР',
      name: 'ОХТОР; Кафедра органічної хімії та технології органічних речовин',
    },
    {
      shortName: 'ТЕХВ',
      name: 'ТЕХВ; Кафедра технології електрохімічних виробництв',
    },
    {
      shortName: 'ТНР,ВтаЗХТ',
      name: 'ТНР,ВтаЗХТ; Кафедра технології неорганічних речовин, водоочищення та загальної хімічної технології',
    },
    {
      shortName: 'ФХ',
      name: 'ФХ; Кафедра фізичної хімії',
    },
    {
      shortName: 'ХТКМ',
      name: 'ХТКМ; Кафедра хімічної технології композиційних матеріалів',
    },
    {
      shortName: 'ХТКС',
      name: 'ХТКС; Кафедра хімічної технології кераміки та скла',
    },
  ]],
  ['ІССЗІ', [
    {
      shortName: 'Кафедра №1',
      name: 'Кафедра №1; Спеціальна кафедра №1',
    },
    {
      shortName: 'Кафедра №2',
      name: 'Кафедра №2; Спеціальна кафедра №2',
    },
    {
      shortName: 'Кафедра №3',
      name: 'Кафедра №3; Спеціальна кафедра №3',
    },
    {
      shortName: 'Кафедра №4',
      name: 'Кафедра №4; Спеціальна кафедра №4',
    },
    {
      shortName: 'Кафедра №5',
      name: 'Кафедра №5; Спеціальна кафедра №5',
    },
  ]],
]);
