export class Speciality {
  public id: string;
  public name: string;
}

export const SPECIALITY_LIST: Speciality[] = [
  {
    id: '32',
    name: 'Історія та археологія'
  },
  {
    id: '33',
    name: 'Філософія'
  },
  {
    id: '35',
    name: 'Філологія'
  },
  {
    id: '51',
    name: 'Економіка'
  },
  {
    id: '53',
    name: 'Психологія'
  },
  {
    id: '54',
    name: 'Соціологія'
  },
  {
    id: '61',
    name: 'Журналістика'
  },
  {
    id: '73',
    name: 'Менеджмент'
  },
  {
    id: '75',
    name: 'Маркетинг'
  },
  {
    id: '81',
    name: 'Право'
  },
  // {
  //   id: '91',
  //   name: 'Біологія'
  // },
  {
    id: '101',
    name: 'Екологія'
  },
  {
    id: '104',
    name: 'Фізика та астрономія'
  },
  {
    id: '105',
    name: 'Прикладна фізика та наноматеріали'
  },
  {
    id: '111',
    name: 'Математика'
  },
  {
    id: '113',
    name: 'Прикладна математика'
  },
  {
    id: '121',
    name: 'Інженерія програмного забезпечення'
  },
  {
    id: '122',
    name: 'Комп’ютерні науки'
  },
  {
    id: '123',
    name: 'Комп’ютерна інженерія'
  },
  {
    id: '124',
    name: 'Системний аналіз'
  },
  {
    id: '125',
    name: 'Кібербезпека'
  },
  {
    id: '131',
    name: 'Прикладна механіка'
  },
  {
    id: '132',
    name: 'Матеріалознавство'
  },
  {
    id: '133',
    name: 'Галузеве машинобудування'
  },
  {
    id: '134',
    name: 'Авіаційна та ракетно-космічна техніка'
  },
  {
    id: '136',
    name: 'Металургія'
  },
  {
    id: '141',
    name: 'Електроенергетика, електротехніка та електромеханіка'
  },
  {
    id: '142',
    name: 'Енергетичне машинобудування'
  },
  {
    id: '143',
    name: 'Атомна енергетика'
  },
  {
    id: '144',
    name: 'Теплоенергетика'
  },
  {
    id: '151',
    name: 'Автоматизація та комп’ютерно-інтегровані технології'
  },
  {
    id: '152',
    name: 'Метрологія та інформаційно-вимірювальна техніка'
  },
  {
    id: '153',
    name: 'Мікро- та наносистемна техніка'
  },
  {
    id: '161',
    name: 'Хімічні технології та інженерія'
  },
  {
    id: '162',
    name: 'Біотехнології та біоінженерія'
  },
  {
    id: '163',
    name: 'Біомедична інженерія'
  },
  {
    id: '171',
    name: 'Електроніка'
  },
  {
    id: '172',
    name: 'Телекомунікації та радіотехніка'
  },
  {
    id: '173',
    name: 'Авіоніка'
  },
  {
    id: '184',
    name: 'Гірництво'
  },
  {
    id: '186',
    name: 'Видавництво та поліграфія'
  },
  {
    id: '227',
    name: 'Фізична терапія, ерготерапія'
  },
  {
    id: '281',
    name: 'Публічне управління та адміністрування'
  },
];
